---
kind: other
id: Properties.T:Autodesk.Revit.DB.LightNode
source: html/b05ae354-8178-9d2c-e514-7083de6d7216.htm
---
# LightNode Properties

Specifies whether the .NET object represents a valid Revit entity.